{"url": "https://tds.s-anand.net/", "title": "Tools in Data Science", "content": "Tools in Data Science - May 2025\nTools in Data Science is a practical diploma level data science course at IIT Madras that teaches popular tools for sourcing data, transforming it, analyzing it, communicating these as visual stories, and deploying them in production.\nThis course exposes you to real-life tools\nThis course is quite hard\nBut it's probably worth it.\nProgramming skills are a pre-requisite\nIf you passed, don't enroll again\nWe encourage learning by sharing\nYou CAN copy from friends. You can work in groups. You can share code. Even in projects, assignments, and exams (except the final end-term exam).\nWhy should you copy? Because in real life, there’s no time to re-invent the wheel. You’ll be working in teams on the shoulders of giants. It’s important to learn how to do that well.\nTo learn well, understand what you’re copying. If you’re short of time, prioritize.\nTo learn better, teach what you’ve learnt.\nWe cover 7 modules in 12 weeks\nThe content evolves with technology and feedback. Track the commit history for changes.\nDevelopment Tools and concepts to build models and apps.\nDeployment Tools and concepts to publish what you built.\nLarge Language Models that make your work easier and your apps smarter.\nData Sourcing to get data from the web, files, and databases.\nData Preparation to clean up and convert the inputs to the right format.\nData Analysis to find surprising insights in the data.\nData Visualization to communicate those insights as visual stories.\nAnyone can audit this course\nEveryone has access to:\nCourse content at https://tds.s-anand.net/\nEvaluations\nYou can solve these questions any time and check your answers before the submission dates.\nOnly enrolled students can participate in Discourse, get project evaluations, take the final end-term, or get a certificate.\nThose auditing can join the TDS 2025 May Google Group for announcements.\nEvaluations are mostly open Internet\nTentative dates:\nExam Type Weight Release Date Submission Date\nGA: Graded assignments Best 4 out of 7 15%\nGraded Assignment 1 Discuss Online open-Internet MCQ Thu 01 May 2025 Sun 18 May 2025\nGraded Assignment 2 Discuss Online open-Internet MCQ Thu 05 May 2025 Sun 25 May 2025\nGraded Assignment 3 Discuss Online open-Internet MCQ Fri 20 May 2025 Sun 01 Jun 2025\nP1: Project 1 Online open-Internet 20% Fri 16 May 2025 Sat 14 Jun 2025\nGraded Assignment 4 Online open-Internet MCQ Wed 11 Jun 2025 Sun 22 Jun 2025\nGraded Assignment 5 Online open-Internet MCQ Wed 18 Jun 2025 Sun 29 Jun 2025\nGraded Assignment 6 Online open-Internet MCQ Wed 02 Jul 2025 Sun 13 Jul 2025\nROE: Remote Online Exam Online open-Internet MCQ 20% Sun 20 Jul 2025 13:00 Sun 20 Jul 2025 13:45\nGraded Assignment 7 Online open-Internet MCQ Wed 16 Jul 2025 Sun 27 Jul 2025\nP2: Project 2 Online open-Internet 20% Fri 11 Jul 2025 Fri 8 Aug 2025\nF: Final end-term In-person, no internet 25% Sun 31 Aug 2025 Sun 31 Aug 2025\nUpdates:\n5 May 2025:\nGA1 submission date postponed from 11 May to 18 May 2025\nGA2 submission date postponed from 18 May to 25 May 2025\nGA3 submission date preponed from 01 Jun to 25 May 2025 since there’s a break the week after\nNotes\nGraded Assignment 1 checks course pre-requisites. Please drop this course (do it in a later term) if you score low. It’ll be too tough for you now.\nRemote exams are open and hard\nYou can use the Internet, WhatsApp, ChatGPT, your notes, your friends, your pets…\nThe RoE is especially hard. Read: What is the purpose of an impossible RoE exam?\nFinal exam is in-person and closed book. It tests your memory. It’s easy.\nProjects test application. The projects test how well you apply what you learnt in a real-world context.\nBonus activities may be posted on Discourse. See previous bonus activities\nEvaluations are mostly automated. This course uses pre-computed (for objective) or LLMs (for subjective) evaluations.\nLLMs will evaluate you differently each time. Learn to prompt them robustly to get higher marks.\nConstantly check communications\nCheck these three links regularly to keep up with the course.\nSeek Notifications for Course Notifications. Log into seek.onlinedegree.iitm.ac.in and click on the bell icon on the top right corner . Check notifications daily.\nYour email for Course Announcements. Seek Inbox are forwarded to your email. Check daily. Check spam folders too.\nTDS Discourse: Faculty, instructors, and TAs will share updates and address queries here. Email support@study.iitm.ac.in cc: discourse-staff1@study.iitm.ac.in if you can’t access Discourse.\nPeople who help you\nFaculty (who design the course)\nAnand S, root.node@gmail.com | @s.anand\nInstructors (who teach the course)\nCarlton D’Silva. 22f3001919@ds.study.iitm.ac.in | @carlton\nPrasanna S, prasanna@study.iitm.ac.in | @iamprasna\nTeaching assistants (who help you with your doubts)\nJivraj Singh, 22f3002542@ds.study.iitm.ac.in | @Jivraj | LinkedIn Profile\nSuchintika Sarkar, 21f3002441@ds.study.iitm.ac.in | @21f3002441\nHritik Roshan Maurya, 22f3002460@ds.study.iitm.ac.in | @HritikRoshan_HRM\nSaransh Saini, 22f1001123@ds.study.iitm.ac.in | @Saransh_Saini | LinkedIn Profile\nVirtual TA (GPT Instructions)\nTheir job is to help you. Trouble them for your slightest doubts!\nCourse Links\nTDS: Discourse - Ask questions, get help, and discuss with your peers.\nIITM BS Degree Programme - Student Handbook\nTDS: Public course page\nTDS: Course files – Jupyter notebooks, datasets, etc.\nMay 2025 Links\nGrading Document - May 2025\nTDS: Course page - May 2025 – for students to access course content.\nTDS: Announcement group - May 2025\nTDS: Live Sessions\nPast Course Content\nTDS: Course Content - Jan 2025\nTDS: Live Sessions - Jan 2025 – YouTube playlist\nTDS: Course calendar - Jan 2025\nGrading Document - Jan 2025.\nNext\n1. Development Tools", "source": "course", "timestamp": "2025-06-03T11:08:57.700327"}
